"""
Chapter 4 - Python Advanced (4) : Meaning of Participating Open Source Project
Keywords : opensource
"""
# imports ==============================================================================================================
# ======================================================================================================================
"""  # =================================================================================================================
[ Advantage of Opensource ] --------------------------------------------------------------------------------------------
1. 개발 과정에서 개발 역량 향상 및 보유 스킬 능력 제시 (향상)
2. In-house 개발과 달리 수많은 디버깅, 개선 등을 통해 신뢰성, 안정성 높은 어플리케이션 도출
3. 적시에 사용 가능 (아키텍쳐 효용성, 고품질)
4. 문서, 개선가능성, 지적 재산권 (라이센스) 주의
------------------------------------------------------------------------------------------------------------------------
[ Advantage of Participating Opensource (side project) ] ---------------------------------------------------------------
1. 답변, 기능 추가, 사명감
2. 다양한 이슈 해결을 통한 개발 역량 강화 (개발 실력 상승)
3. 코드 퀄리티, 알고리즘, 다양한 지식 향상
4. ** 구직 시 합격 가능성 향상 (인지도 향상), 창업 시 좋은 팀원 셋업 가능성 향상
5. 이슈 등재를 통해서 문제 해결 가능성 향상 (수많은 개발자 참여)
6. 복잡하고 다양한 기능 배재하고 처음에는 단 몇 줄이라도 오픈소스 업로드 추천
7. 효율적인 코드 작성 노하우 향상
8. 서로 공유하고 돌려주는 문화 체험
------------------------------------------------------------------------------------------------------------------------
"""  # =================================================================================================================
