"""
Chapter 4 - Python Advanced (4) : 나만의 Package 만들기 (4) - Github 배포
Keywords : Github, package deploy
"""
# imports ==============================================================================================================
# ======================================================================================================================
"""  # =================================================================================================================
[ Package 배포 순서 ( Github ) ] -----------------------------------------------------------------------------------------
1. https://github.com register
2. git 설치 확인 git --version
3. git add -> commit -> push
    - git repository 저장소 생성
    - git init
    - git add .
    - git status
    - git commit -m "message"
    - git remote add origin "your repository"
    - git push origin master
4. PyPI 형태의 패키지 구조를 github repository 에 push
5. 설치 확인 ( pip install git+https://your-repository-url )
------------------------------------------------------------------------------------------------------------------------
"""  # =================================================================================================================
