"""
Chapter 4 - Python Advanced (4) : 나만의 Package 만들기 (1)
Keywords : png (jpg) to gif, pil, image
"""
# imports ==============================================================================================================
import glob
from PIL import Image
# ======================================================================================================================
"""  # =================================================================================================================
[ TO DO ] --------------------------------------------------------------------------------------------------------------
패키지 작성 -> 정적이미지 (png, jpg) -> GIF (애니메이션) 이미지 변환 패키지
------------------------------------------------------------------------------------------------------------------------
"""  # =================================================================================================================

# Image and Output path
path_in = "../../support/images/*.png"
path_out = "../../support/image_out/result.gif"

# 첫 번쨰 이미지 & 모든 이미지 리스트 패킹
# img, *images = [Image.open(f) for f in sorted(glob.glob(path_in))]

# resize
img, *images = [Image.open(f).resize((320, 240), Image.LANCZOS) for f in sorted(glob.glob(path_in))]
print(img)
print(images)

# 이미지 저장
img.save(
    fp=path_out,
    format='GIF',
    append_images=images,
    save_all=True,
    duration=500,
    loop=0
)

